In [44]:

import numpy as np
import pandas as pd
student={"id": [1,2,3,4,5,6],"Name":["A","B","c","D","E","F"],"Age":[21,20,23,24,20,np.nan],"Degree":["MCA","MA","MBA","MSC","MCA","MA"],"cgpa":[7.5,9,8,8.2,7,np.nan]}
df=pd.DataFrame(student)
print(df)

   id Name   Age Degree  cgpa
0   1    A  21.0    MCA   7.5
1   2    B  20.0     MA   9.0
2   3    c  23.0    MBA   8.0
3   4    D  24.0    MSC   8.2
4   5    E  20.0    MCA   7.0
5   6    F   NaN     MA   NaN

In [14]:
#a
clas=["First","second","distinction","Second","first","Third"]
df["Class"]=clas
print(df)

   id Name   Age Degree  cgpa        Class
0   1    A  21.0    MCA   7.5        First
1   2    B  20.0     MA   9.0       second
2   3    c  23.0    MBA   8.0  distinction
3   4    D  24.0    MSC   8.2       Second
4   5    E  20.0    MCA   7.0        first
5   6    F   NaN     MA   NaN        Third

In [6]:
#b
col=len(df.axes[1])
print("No. of Columns: ",col)

No. of Columns:  6

In [20]:
#c
print(df.head(3),"\n",df.tail(4))

   id Name   Age Degree  cgpa        Class
0   1    A  21.0    MCA   7.5        First
1   2    B  20.0     MA   9.0       second
2   3    c  23.0    MBA   8.0  distinction
    id Name   Age Degree  cgpa        Class
2   3    c  23.0    MBA   8.0  distinction
3   4    D  24.0    MSC   8.2       Second
4   5    E  20.0    MCA   7.0        first
5   6    F   NaN     MA   NaN        Third

In [9]:
print(df.head(3))
print(df.tail(3))

   id Name   Age Degree  cgpa        Class
0   1    A  21.0    MCA   7.5        First
1   2    B  20.0     MA   9.0       second
2   3    c  23.0    MBA   8.0  distinction
   id Name   Age Degree  cgpa   Class
3   4    D  24.0    MSC   8.2  Second
4   5    E  20.0    MCA   7.0   first
5   6    F   NaN     MA   NaN   Third

In [10]:
#d
df=df.dropna()
print(df)

   id Name   Age Degree  cgpa        Class
0   1    A  21.0    MCA   7.5        First
1   2    B  20.0     MA   9.0       second
2   3    c  23.0    MBA   8.0  distinction
3   4    D  24.0    MSC   8.2       Second
4   5    E  20.0    MCA   7.0        first

In [21]:
#e
df.pop("id")
print(df)

0    1
1    2
2    3
3    4
4    5
5    6
Name: id, dtype: int64

In [17]:
#f
print(df.loc[[2,3,4,5],["Name","cgpa"]])

  Name   Age
2    c  23.0
3    D  24.0
4    E  20.0
5    F   NaN

In [45]:
#g
print(df["Age"])
mean=df["Age"].mean()
df["Age"].fillna(mean,inplace=True)
print(df)

0    21.0
1    20.0
2    23.0
3    24.0
4    20.0
5     NaN
Name: Age, dtype: float64
   id Name   Age Degree  cgpa
0   1    A  21.0    MCA   7.5
1   2    B  20.0     MA   9.0
2   3    c  23.0    MBA   8.0
3   4    D  24.0    MSC   8.2
4   5    E  20.0    MCA   7.0
5   6    F  21.6     MA   NaN

In [46]:

df=pd.read_csv("iris.csv") 
print(df)

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [47]:
df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.054000      3.758667     1.198667
std        0.828066     0.433594      1.764420     0.763161
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [49]:
df.isnull().sum()

sepal_length    0
sepal_width     0
petal_length    0
petal_width     0
species         0
dtype: int64

In [50]:
df=df.dropna()
print(df)

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [51]:
df.value_counts("species")

species
setosa        50
versicolor    50
virginica     50
dtype: int64

In [53]:
df.count("species")

ValueError: No axis named species for object type DataFrame